# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные.

letters = str(input('Введите строчные буквы: '))
print(letters.upper())
